#### Terraform Plan (ModTest) github-repos/dev 🖌``

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/roknsound/github-repos-dev/runs/run-qWDZoJjDmD7xWySZ

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...
module.terraform-apply.data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.centralized-actions.data.github_organization_teams.root_teams[0]: Reading...
module.tfe-public-tools.data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-validate.github_repository.repo: Refreshing state... [id=terraform-validate]
module.terraform-validate.data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-book.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["windows-image-pipeline"].github_repository.repo: Refreshing state... [id=windows-image-pipeline]
module.terraform-book.github_repository.repo: Refreshing state... [id=terraform-book]
module.gov_repo["linux-image-pipeline"].github_repository.repo: Refreshing state... [id=linux-image-pipeline]
module.gov_repo["ghe-runner"].github_repository.repo: Refreshing state... [id=ghe-runner]
module.centralized-actions.data.github_organization_teams.root_teams[0]: Read complete after 0s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["arnol377-sandbox"].github_repository.repo: Refreshing state... [id=arnol377-sandbox]
module.gov_repo["docker-image-pipeline"].github_repository.repo: Refreshing state... [id=docker-image-pipeline]
module.terraform-book.data.github_organization_teams.root_teams[0]: Read complete after 2s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.terraform-apply.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["image-pipeline-ansible-playbooks"].github_repository.repo: Refreshing state... [id=image-pipeline-ansible-playbooks]
module.gov_repo["image-pipeline-goss-testing"].github_repository.repo: Refreshing state... [id=image-pipeline-goss-testing]
module.gov_repo["automation-repos"].github_repository.repo: Refreshing state... [id=automation-repos]
module.seed-workspace.data.github_organization_teams.root_teams[0]: Reading...
module.centralized-actions.data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-plan.github_repository.repo: Refreshing state... [id=terraform-plan]
module.terraform-apply.data.github_organization_teams.root_teams[0]: Read complete after 2s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.repo.github_repository.repo: Refreshing state... [id=aws-codebuild-image-pipeline]
module.gov_repo["windows-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.gov_repo["arnol377-sandbox"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.seed-workspace.data.github_organization_teams.root_teams[0]: Read complete after 3s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["ghe-runner"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-apply.data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 7s [id=10138997]
module.gov_repo["docker-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-validate.data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 7s [id=10138997]
module.gov_repo["linux-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.tfe-public-tools.data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 7s [id=10138997]
module.gov_repo["image-pipeline-goss-testing"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.gov_repo["image-pipeline-ansible-playbooks"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.gov_repo["automation-repos"].data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.terraform-plan.data.github_organization_teams.root_teams[0]: Reading...
module.terraform-plan.data.github_organization_teams.root_teams[0]: Read complete after 1s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.terraform-plan.data.github_user.pull_request_bypassers["djaboxx"]: Reading...
module.centralized-actions.data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 6s [id=10138997]
module.chromebook_venv.github_repository.repo: Refreshing state... [id=chromebook-venv]
module.gov_repo["windows-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 5s [id=10138997]
module.seed-workspace.github_repository.repo: Refreshing state... [id=seed-workspace]
module.gov_repo["arnol377-sandbox"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 5s [id=10138997]
module.terraform-apply.github_repository.repo: Refreshing state... [id=terraform-apply]
module.gov_repo["ghe-runner"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 4s [id=10138997]
module.centralized-actions.github_repository.repo: Refreshing state... [id=centralized-actions]
module.terraform-validate.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["docker-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 3s [id=10138997]
module.repo.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["linux-image-pipeline"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 3s [id=10138997]
module.tfe-public-tools.github_repository.repo: Refreshing state... [id=tfe-public-tools]
module.gov_repo["image-pipeline-goss-testing"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 3s [id=10138997]
module.tfe-public-tools.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["image-pipeline-ansible-playbooks"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 3s [id=10138997]
module.chromebook_venv.data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["automation-repos"].data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 3s [id=10138997]
module.gov_repo["automation-repos"].data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["linux-image-pipeline"].data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["docker-image-pipeline"].data.github_organization_teams.root_teams[0]: Reading...
module.terraform-validate.data.github_organization_teams.root_teams[0]: Read complete after 1s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["windows-image-pipeline"].data.github_organization_teams.root_teams[0]: Reading...
module.repo.data.github_organization_teams.root_teams[0]: Read complete after 2s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["arnol377-sandbox"].data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["image-pipeline-goss-testing"].data.github_organization_teams.root_teams[0]: Reading...
module.tfe-public-tools.data.github_organization_teams.root_teams[0]: Read complete after 3s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["ghe-runner"].data.github_organization_teams.root_teams[0]: Reading...
module.chromebook_venv.data.github_organization_teams.root_teams[0]: Read complete after 5s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["image-pipeline-ansible-playbooks"].data.github_organization_teams.root_teams[0]: Reading...
module.gov_repo["automation-repos"].data.github_organization_teams.root_teams[0]: Read complete after 6s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
data.google_secret_manager_secret_version.basic: Reading...
data.google_secret_manager_secret_version.basic: Read complete after 0s [id=projects/24958391400/secrets/github_token/versions/1]
module.terraform-validate.github_repository_file.codeowners[0]: Refreshing state... [id=terraform-validate/CODEOWNERS]
module.terraform-plan.data.github_user.pull_request_bypassers["djaboxx"]: Read complete after 9s [id=10138997]
module.terraform-book.github_repository_file.codeowners[0]: Refreshing state... [id=terraform-book/CODEOWNERS]
module.gov_repo["linux-image-pipeline"].data.github_organization_teams.root_teams[0]: Read complete after 7s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.terraform-plan.github_repository_file.codeowners[0]: Refreshing state... [id=terraform-plan/CODEOWNERS]
module.gov_repo["docker-image-pipeline"].data.github_organization_teams.root_teams[0]: Read complete after 8s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.repo.github_repository_file.codeowners[0]: Refreshing state... [id=aws-codebuild-image-pipeline/CODEOWNERS]
module.gov_repo["image-pipeline-goss-testing"].github_repository_file.codeowners[0]: Refreshing state... [id=image-pipeline-goss-testing/CODEOWNERS]
module.gov_repo["windows-image-pipeline"].data.github_organization_teams.root_teams[0]: Read complete after 9s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["automation-repos"].github_repository_file.codeowners[0]: Refreshing state... [id=automation-repos/CODEOWNERS]
module.gov_repo["arnol377-sandbox"].data.github_organization_teams.root_teams[0]: Read complete after 9s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["linux-image-pipeline"].github_repository_file.codeowners[0]: Refreshing state... [id=linux-image-pipeline/CODEOWNERS]
module.gov_repo["image-pipeline-goss-testing"].data.github_organization_teams.root_teams[0]: Read complete after 9s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["windows-image-pipeline"].github_repository_file.codeowners[0]: Refreshing state... [id=windows-image-pipeline/CODEOWNERS]
module.gov_repo["ghe-runner"].data.github_organization_teams.root_teams[0]: Still reading... [10s elapsed]
module.gov_repo["ghe-runner"].data.github_organization_teams.root_teams[0]: Read complete after 11s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["arnol377-sandbox"].github_repository_file.codeowners[0]: Refreshing state... [id=arnol377-sandbox/CODEOWNERS]
module.gov_repo["image-pipeline-ansible-playbooks"].data.github_organization_teams.root_teams[0]: Still reading... [10s elapsed]
module.gov_repo["image-pipeline-ansible-playbooks"].data.github_organization_teams.root_teams[0]: Read complete after 10s [id=MDEyOk9yZ2FuaXphdGlvbjMzNTgxNDY1]
module.gov_repo["image-pipeline-ansible-playbooks"].github_repository_file.codeowners[0]: Refreshing state... [id=image-pipeline-ansible-playbooks/CODEOWNERS]
module.gov_repo["docker-image-pipeline"].github_repository_file.codeowners[0]: Refreshing state... [id=docker-image-pipeline/CODEOWNERS]
module.gov_repo["ghe-runner"].github_repository_file.codeowners[0]: Refreshing state... [id=ghe-runner/CODEOWNERS]
module.chromebook_venv.github_repository_file.codeowners[0]: Refreshing state... [id=chromebook-venv/CODEOWNERS]
module.seed-workspace.github_repository_file.codeowners[0]: Refreshing state... [id=seed-workspace/CODEOWNERS]
module.terraform-apply.github_repository_file.codeowners[0]: Refreshing state... [id=terraform-apply/CODEOWNERS]
module.tfe-public-tools.github_repository_file.codeowners[0]: Refreshing state... [id=tfe-public-tools/CODEOWNERS]
github_actions_organization_secret.example_secret: Refreshing state... [id=GH_TOKEN]
module.centralized-actions.github_repository_file.codeowners[0]: Refreshing state... [id=centralized-actions/CODEOWNERS]
module.terraform-validate.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOMm_CJM4DMgh7]
module.terraform-plan.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOMm_CEc4DMgh6]
module.terraform-apply.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOMm_CNs4DMgh8]
module.centralized-actions.github_branch_protection.main[0]: Refreshing state... [id=BPR_kwDOMmknLc4DMYPO]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.centralized-actions.github_repository.repo has changed
  ~ resource "github_repository" "repo" {
      ~ etag                        = "W/"8f42402868950a4629e142c34f4072d3194044605baf0b04c72f0370b0def7c6"" -> "W/"814603a52713c2f4f28d79bb665f6aad96ff9f3e939ab960a1e2121bec6ae9b3""
        id                          = "centralized-actions"
        name                        = "centralized-actions"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gov_repo["image-pipeline-ansible-playbooks"].github_repository.repo has changed
  ~ resource "github_repository" "repo" {
      ~ etag                        = "W/"e5b6ea2b147704cc8d6a703a9388be34dad0855b1d200b88dc4a1714ff7cc491"" -> "W/"6add42534b2016f07649f9e493a5e026a9d3f383ca9626eadc5f7104e6118b16""
        id                          = "image-pipeline-ansible-playbooks"
        name                        = "image-pipeline-ansible-playbooks"
        # (37 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.centralized-actions.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/centralized-actions" -> (known after apply)
        id                          = "centralized-actions"
      ~ name                        = "centralized-actions" -> "centralized-actions-crufty"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.centralized-actions.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "88b0477a7cca88af5fcf0b0f5396af7255934246" -> (known after apply)
      ~ id                  = "centralized-actions/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "centralized-actions" -> "centralized-actions-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.chromebook_venv.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/chromebook-venv" -> (known after apply)
        id                          = "chromebook-venv"
      ~ name                        = "chromebook-venv" -> "chromebook-venv-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.chromebook_venv.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "434ebeb4a49b3ff98ba6901e002b715038f06a01" -> (known after apply)
      ~ id                  = "chromebook-venv/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "chromebook-venv" -> "chromebook-venv-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["arnol377-sandbox"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/arnol377-sandbox" -> (known after apply)
        id                          = "arnol377-sandbox"
      ~ name                        = "arnol377-sandbox" -> "arnol377-sandbox-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["arnol377-sandbox"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "adf89b32d2c6bec8d460c3daba767f89784d5bfe" -> (known after apply)
      ~ id                  = "arnol377-sandbox/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "arnol377-sandbox" -> "arnol377-sandbox-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["automation-repos"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/automation-repos" -> (known after apply)
        id                          = "automation-repos"
      ~ name                        = "automation-repos" -> "automation-repos-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["automation-repos"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "f027f43fe7e574edf3a2c04aec46a1747b1f6b9b" -> (known after apply)
      ~ id                  = "automation-repos/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "automation-repos" -> "automation-repos-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["docker-image-pipeline"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/docker-image-pipeline" -> (known after apply)
        id                          = "docker-image-pipeline"
      ~ name                        = "docker-image-pipeline" -> "docker-image-pipeline-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["docker-image-pipeline"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "f13095eb090fee05a20081b0fbd134a5c7757a73" -> (known after apply)
      ~ id                  = "docker-image-pipeline/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "docker-image-pipeline" -> "docker-image-pipeline-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["ghe-runner"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/ghe-runner" -> (known after apply)
        id                          = "ghe-runner"
      ~ name                        = "ghe-runner" -> "ghe-runner-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["ghe-runner"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "86c0e1c84fe6b6e143f3462a53d3904e417e96fc" -> (known after apply)
      ~ id                  = "ghe-runner/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "ghe-runner" -> "ghe-runner-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["image-pipeline-ansible-playbooks"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/image-pipeline-ansible-playbooks" -> (known after apply)
        id                          = "image-pipeline-ansible-playbooks"
      ~ name                        = "image-pipeline-ansible-playbooks" -> "image-pipeline-ansible-playbooks-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["image-pipeline-ansible-playbooks"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "c2fc56fc2d4af885853dc3ed44a189cbd1bd3849" -> (known after apply)
      ~ id                  = "image-pipeline-ansible-playbooks/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "image-pipeline-ansible-playbooks" -> "image-pipeline-ansible-playbooks-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["image-pipeline-goss-testing"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/image-pipeline-goss-testing" -> (known after apply)
        id                          = "image-pipeline-goss-testing"
      ~ name                        = "image-pipeline-goss-testing" -> "image-pipeline-goss-testing-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["image-pipeline-goss-testing"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "9bc0bc63340aba0212606bfa2ce7858fb4dd6cbd" -> (known after apply)
      ~ id                  = "image-pipeline-goss-testing/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "image-pipeline-goss-testing" -> "image-pipeline-goss-testing-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["linux-image-pipeline"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/linux-image-pipeline" -> (known after apply)
        id                          = "linux-image-pipeline"
      ~ name                        = "linux-image-pipeline" -> "linux-image-pipeline-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["linux-image-pipeline"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "42d96e949e86644ba71524485d01f9f21c555961" -> (known after apply)
      ~ id                  = "linux-image-pipeline/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "linux-image-pipeline" -> "linux-image-pipeline-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gov_repo["windows-image-pipeline"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/windows-image-pipeline" -> (known after apply)
        id                          = "windows-image-pipeline"
      ~ name                        = "windows-image-pipeline" -> "windows-image-pipeline-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.gov_repo["windows-image-pipeline"].github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "f632e0f8437ac4f9155144327282a6e10a88ddb3" -> (known after apply)
      ~ id                  = "windows-image-pipeline/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "windows-image-pipeline" -> "windows-image-pipeline-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.repo.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/aws-codebuild-image-pipeline" -> (known after apply)
        id                          = "aws-codebuild-image-pipeline"
      ~ name                        = "aws-codebuild-image-pipeline" -> "aws-codebuild-image-pipeline-crufty"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repo.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "a5e93eba728752daf140fc4b4a093e65b76cfe0d" -> (known after apply)
      ~ id                  = "aws-codebuild-image-pipeline/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "aws-codebuild-image-pipeline" -> "aws-codebuild-image-pipeline-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.seed-workspace.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/seed-workspace" -> (known after apply)
        id                          = "seed-workspace"
      ~ name                        = "seed-workspace" -> "seed-workspace-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.seed-workspace.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "bb37eed47014be17d3f2ab6b6ea01487ebe3506d" -> (known after apply)
      ~ content             = <<-EOT
          - #### How to use this file: https://help.github.com/en/github/creating-cloning-and-archiving-repositories/about-code-owners
          - #### Example file: https://github.corp.clover.com/clover/examples-repo/blob/main/CODEOWNERS
          - 
            # These owners will be the default owners for everything in the repo. Unless a later match takes precedence
          - *     @clover/terraform-reviewers
          + *     @HappyPathway/terraform-reviewers
        EOT
      ~ id                  = "seed-workspace/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "seed-workspace" -> "seed-workspace-crufty" # forces replacement
      ~ sha                 = "1ec55658ae13dfeb4e78451158c19a2d54836782" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.terraform-apply.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/terraform-apply" -> (known after apply)
        id                          = "terraform-apply"
      ~ name                        = "terraform-apply" -> "terraform-apply-crufty"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-apply.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "8809c8cf018bb1aa821625a96d180c9ab9a7b6cc" -> (known after apply)
      ~ id                  = "terraform-apply/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "terraform-apply" -> "terraform-apply-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.terraform-book.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/terraform-book" -> (known after apply)
        id                          = "terraform-book"
      ~ name                        = "terraform-book" -> "terraform-book-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.terraform-book.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "78b9e79414e661ceff1a0527054b2ce88101e9a1" -> (known after apply)
      ~ id                  = "terraform-book/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "terraform-book" -> "terraform-book-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.terraform-plan.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/terraform-plan" -> (known after apply)
        id                          = "terraform-plan"
      ~ name                        = "terraform-plan" -> "terraform-plan-crufty"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-plan.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "05e7a8722bb0a2712409ea19361590c39b6981d1" -> (known after apply)
      ~ id                  = "terraform-plan/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "terraform-plan" -> "terraform-plan-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.terraform-validate.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/terraform-validate" -> (known after apply)
        id                          = "terraform-validate"
      ~ name                        = "terraform-validate" -> "terraform-validate-crufty"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-validate.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "f5742a0e70ba58d6630a456bdfea44a92c5da251" -> (known after apply)
      ~ id                  = "terraform-validate/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "terraform-validate" -> "terraform-validate-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.tfe-public-tools.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ full_name                   = "HappyPathway/tfe-public-tools" -> (known after apply)
        id                          = "tfe-public-tools"
      ~ name                        = "tfe-public-tools" -> "tfe-public-tools-crufty"
        # (37 unchanged attributes hidden)
    }

  # module.tfe-public-tools.github_repository_file.codeowners[0] must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_message      = "Add CODEOWNERS" -> (known after apply)
      ~ commit_sha          = "fdfa3e8115d572d2c1265378e70cc7798f7c856e" -> (known after apply)
      ~ id                  = "tfe-public-tools/CODEOWNERS" -> (known after apply)
      ~ ref                 = "main" -> (known after apply)
      ~ repository          = "tfe-public-tools" -> "tfe-public-tools-crufty" # forces replacement
      ~ sha                 = "e6a937236e06dca2afabd40edefba5251ba764ae" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 17 to add, 17 to change, 17 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "credentials" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-qWDZoJjDmD7xWySZ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 39 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @djaboxx, Action: `pull_request`, Target Workspace: `dev`, Workflow: `ModTest: dev`*